Tekla Open API Reference for Tekla Structures 2025
Dialogs.SetSettings Method
 Forces the dialog system to get the language and localization settings from Tekla Structures.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static int SetSettings(
	string param
)
Public Shared Function SetSettings (
	param As String
) As Integer
Parameters
param
Type: System.String
Not used.
Return Value
Type: Int32
0 always.
See Also
Reference
Dialogs Class
Tekla.Structures.Dialog Namespace